/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   pipe_utils.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: juwang < juwang@student.42tokyo.jp>        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/07/05 13:25:54 by juwang            #+#    #+#             */
/*   Updated: 2025/07/05 13:25:55 by juwang           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "pipex.h" // 包含项目主头文件

/*
** create_pipe
** 创建一个匿名管道，并将其读写端文件描述符存储在提供的数组中。
** 如果管道创建失败，则会调用错误处理函数并退出程序。
** @param pipefd 存储管道读写端文件描述符的整数数组 (pipefd[0]为读端，pipefd[1]为写端)。
** @return void。
*/
void	create_pipe(int pipefd[2])
{
	if (pipe(pipefd) == -1) // 调用 pipe() 系统调用
	{
		handle_system_error("Error creating pipe"); // 如果失败，处理系统错误并退出
	}
}
